vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7034.inc
; ===============================================																		
; ADuC7034 HEADER FILE REV 1.4																		
; ===============================================																		
Z_BASE                         EQU       0xFFFF0000
F_BASE                         EQU       0xFFFFF000
MMR_BASE                       EQU       0xFFFF0000
MMR_BASE_LOW                   EQU       0xFFFF0000
MMR_BASE_HIGH                  EQU       0xFFFFF000

; Interrupt Controller

INTBASE                        EQU       0xFFFF0000
IRQSTA                         EQU       0xFFFF0000
IRQSIG                         EQU       0xFFFF0004
IRQEN                          EQU       0xFFFF0008
IRQCLR                         EQU       0xFFFF000C
SWICFG                         EQU       0xFFFF0010
FIQSTA                         EQU       0xFFFF0100
FIQSIG                         EQU       0xFFFF0104
FIQEN                          EQU       0xFFFF0108
FIQCLR                         EQU       0xFFFF010C
Z_IRQSTA                       EQU       IRQSTA    -Z_BASE
Z_IRQSIG                       EQU       IRQSIG    -Z_BASE
Z_IRQEN                        EQU       IRQEN     -Z_BASE
Z_IRQCLR                       EQU       IRQCLR    -Z_BASE
Z_SWICFG                       EQU       SWICFG    -Z_BASE
Z_FIQSTA                       EQU       FIQSTA    -Z_BASE
Z_FIQSIG                       EQU       FIQSIG    -Z_BASE
Z_FIQEN                        EQU       FIQEN     -Z_BASE
Z_FIQCLR                       EQU       FIQCLR    -Z_BASE

T_IRQSTA                       EQU       IRQSTA    -INTBASE   
T_IRQSIG                       EQU       IRQSIG    -INTBASE   
T_IRQEN                        EQU       IRQEN     -INTBASE   
T_IRQCLR                       EQU       IRQCLR    -INTBASE   
T_SWICFG                       EQU       SWICFG    -INTBASE   
T_FIQSTA                       EQU       FIQSTA    -INTBASE   
T_FIQSIG                       EQU       FIQSIG    -INTBASE   
T_FIQEN                        EQU       FIQEN     -INTBASE   
T_FIQCLR                       EQU       FIQCLR    -INTBASE   

IRQSTA_OFFSET                  EQU       0x0000
IRQSIG_OFFSET                  EQU       0x0004
IRQEN_OFFSET                   EQU       0x0008
IRQCLR_OFFSET                  EQU       0x000C
SWICFG_OFFSET                  EQU       0x0010
FIQSTA_OFFSET                  EQU       0x0100
FIQSIG_OFFSET                  EQU       0x0104
FIQEN_OFFSET                   EQU       0x0108
FIQCLR_OFFSET                  EQU       0x010C

; Remap and System Control

REMAPBASE                      EQU       0xFFFF0200
SYSMAP0                        EQU       0xFFFF0220
RSTSTA                         EQU       0xFFFF0230
RSTCLR                         EQU       0xFFFF0234
SYSSER0                        EQU       0xFFFF0238
SYSSER1                        EQU       0xFFFF023C
SYSCHK                         EQU       0xFFFF0240
Z_SYSMAP0                      EQU       SYSMAP0   -Z_BASE
Z_RSTSTA                       EQU       RSTSTA    -Z_BASE
Z_RSTCLR                       EQU       RSTCLR    -Z_BASE
Z_SYSSER0                      EQU       SYSSER0   -Z_BASE
Z_SYSSER1                      EQU       SYSSER1   -Z_BASE
Z_SYSCHK                       EQU       SYSCHK    -Z_BASE

T_SYSMAP0                      EQU       SYSMAP0   -REMAPBASE 
T_RSTSTA                       EQU       RSTSTA    -REMAPBASE 
T_RSTCLR                       EQU       RSTCLR    -REMAPBASE 
T_SYSSER0                      EQU       SYSSER0   -REMAPBASE 
T_SYSSER1                      EQU       SYSSER1   -REMAPBASE 
T_SYSCHK                       EQU       SYSCHK    -REMAPBASE 

SYSMAP0_OFFSET                 EQU       0x0220
RSTSTA_OFFSET                  EQU       0x0230
RSTCLR_OFFSET                  EQU       0x0234
SYSSER0_OFFSET                 EQU       0x0238
SYSSER1_OFFSET                 EQU       0x023C
SYSCHK_OFFSET                  EQU       0x0240

; 48bit General Purpose Timer 0

TIMER0BASE                     EQU       0xFFFF0300
T0LD                           EQU       0xFFFF0300
T0VAL0                         EQU       0xFFFF0304
T0VAL1                         EQU       0xFFFF0308
T0CON                          EQU       0xFFFF030C
T0CLRI                         EQU       0xFFFF0310
T0CAP                          EQU       0xFFFF0314
Z_T0LD                         EQU       T0LD      -Z_BASE
Z_T0VAL0                       EQU       T0VAL0    -Z_BASE
Z_T0VAL1                       EQU       T0VAL1    -Z_BASE
Z_T0CON                        EQU       T0CON     -Z_BASE
Z_T0CLRI                       EQU       T0CLRI    -Z_BASE
Z_T0CAP                        EQU       T0CAP     -Z_BASE

T_T0LD                         EQU       T0LD      -TIMER0BASE
T_T0VAL0                       EQU       T0VAL0    -TIMER0BASE
T_T0VAL1                       EQU       T0VAL1    -TIMER0BASE
T_T0CON                        EQU       T0CON     -TIMER0BASE
T_T0CLRI                       EQU       T0CLRI    -TIMER0BASE
T_T0CAP                        EQU       T0CAP     -TIMER0BASE

T0LD_OFFSET                    EQU       0x0300
T0VAL0_OFFSET                  EQU       0x0304
T0VAL1_OFFSET                  EQU       0x0308
T0CON_OFFSET                   EQU       0x030C
T0CLRI_OFFSET                  EQU       0x0310
T0CAP_OFFSET                   EQU       0x0314

; General Purpose Timer 1

TIMER1BASE                     EQU       0xFFFF0320
T1LD                           EQU       0xFFFF0320
T1VAL                          EQU       0xFFFF0324
T1CON                          EQU       0xFFFF0328
T1CLRI                         EQU       0xFFFF032C
T1CAP                          EQU       0xFFFF0330
Z_T1LD                         EQU       T1LD      -Z_BASE
Z_T1VAL                        EQU       T1VAL     -Z_BASE
Z_T1CON                        EQU       T1CON     -Z_BASE
Z_T1CLRI                       EQU       T1CLRI    -Z_BASE
Z_T1CAP                        EQU       T1CAP     -Z_BASE

